def main_menu():
    print("""
    
    ========================
           PC Assistant
    ========================

1. Заметки
2. Задачи
3. Настройки
4. Выход

""")
    
def menu_p1():
    print("""
    ========================
          PC Assistant
            ЗАМЕТКИ
    ========================
          
          1. создать заметку
          2. найти заметку
          3. покзать все
          4. удалить
          5. назад
""")

def menu_p2():
    print("""
     ========================
           PC Assistant
             Задачи
     ========================
          
          1. создать задачу
          2. найти задачу
          3. показать задачи
          4. выполнить задачу
          5. удалить
          6. назад
""")
    

def menu_p3():
    print("""
    ========================
          PC Assistant
            НАСРОЙКИ
    ========================
          1 - ничего
          0 - назад
""")
    
def menu_show_all():
    print("""
    ========================
          PC Assistant
            НАСРОЙКИ
    ========================
          1 - показать все задачи
          2 - показать в процессе
          3 - показать выполненые
          """)
